/** 用户名：4-16 位中文、英文、数字、下划线、短横线 */
export const REG_USER_NAME = /^[\u4E00-\u9FA5a-zA-Z0-9_-]{4,16}$/;

/** 手机号 */
export const REG_PHONE =
  /^[1](([3][0-9])|([4][01456789])|([5][012356789])|([6][2567])|([7][0-8])|([8][0-9])|([9][012356789]))[0-9]{8}$/;

/** 密码：6-18 位字母、数字、下划线 */
export const REG_PWD = /^\w{6,18}$/;

/** 邮箱 */
export const REG_EMAIL = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

/** 六位数字验证码 */
export const REG_CODE_SIX = /^\d{6}$/;

/** 四位数字验证码 */
export const REG_CODE_FOUR = /^\d{4}$/;

/** URL */
export const REG_URL =
  /(((^https?:(?:\/\/)?)(?:[-;:&=+$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=+$,\w]+@)[A-Za-z0-9.-]+)((?:\/[+~%/.\w-_]*)?\??(?:[-+=&;%@.\w_]*)#?(?:[\w]*))?)$/;
